pages/posts/my-emacs-config.org
#+options: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+options: author:t broken-links:nil c:nil creator:nil
#+options: d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t num:t
#+options: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t
#+options: timestamp:t title:t toc:t todo:t |:t
#+date: <2023-04-14 Fri>
#+author: Horhik
#+email: horhik@disroot.org
#+language: en
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 28.2 (Org mode 9.6)
#+cite_export:

#+SETUPFILE: ~/Blog/assets/templates/main.org
#+title: Emacs config.
#+author Horhik
#+BABEL: :cache no
#+PROPERTY: header-args:emacs-lisp :tangle init.el

Here's part of my config for ~org-publish~
* Orb Publish
** Setting up variables
#+begin_src emacs-lisp
  (setq blog-path "~/Space/Code/Blog/")
  (setq blog-static-path "~/Space/Code/Blog/html/")
  (setq blog-content-path "~/Space/Code/Blog/pages/")
  (setq blog-templates "~/Space/Code/Blog/assets/templates/")
#+end_src
