pages/posts/my-emacs-config.org
** Custom sections
#+begin_src emacs-lisp
  (defvar this-date-format "%b %d, %Y")
  (defun blog/html-postamble (plist)
      "PLIST."
      (concat (format
               (with-temp-buffer
                 (insert-file-contents (concat blog-templates "postamble.html")) (buffer-string))
               (format-time-string this-date-format (plist-get plist :time)) (plist-get plist :creator))))

    (defun blog/html-preamble (plist)
    "PLIST: An entry."
    (if (org-export-get-date plist this-date-format)
        (plist-put plist
                   :subtitle (format "Published on %s by %s."
                                     (org-export-get-date plist this-date-format)
                                     (car (plist-get plist :author)))))
    ;; Preamble
    (with-temp-buffer
      (insert-file-contents (concat blog-templates "preamble.html")) (buffer-string)))

  (defun blog/html-index-preamble (plist)
    "PLIST: An entry."
    (if (org-export-get-date plist this-date-format)
        (plist-put plist
                   :subtitle (format "Published on %s by %s."
                                     (org-export-get-date plist this-date-format)
                                     (car (plist-get plist :author)))))
    ;; Preamble
    (with-temp-buffer
      (insert-file-contents (concat blog-templates "index-preamble.html")) (buffer-string)))

#+end_src
** Sitemap
#+begin_src emacs-lisp
  (defun me/org-sitemap-format-entry (entry style project)
    "Format posts with author and published data in the index page.

ENTRY: file-name
STYLE:
PROJECT: `posts in this case."
    (cond ((not (directory-name-p entry))
           (format "*[[file:%s][%s]]*
                 #+HTML: <p class='pubdate'>by %s on %s.</p>"
                   entry
                   (org-publish-find-title entry project)
                   (car (org-publish-find-property entry :author project))
                   (format-time-string this-date-format
                                       (org-publish-find-date entry project))))
          ((eq style 'tree) (file-name-nondirectory (directory-file-name entry)))
          (t entry)))
#+end_src
** Preambles and postambles
#+begin_center emacs-lisp
(setq index-preamble "<section>
                 <div> <h3> Segmentation Fail. Horhik's blog </h3></div>
      <div><ul>
        <li><a href='./posts/index.html'>Posts</a></li>
        <li><a href='./portfolio/index.html'>Portfolio</a></li>
        <li><a href='./about/index.html'>About</a></li>
        <li><a href='./donate/index.html'>Donate</a></li>
        <li><a href='./projects/index.html'>Projects</a></li>
       </ul></div>
                </section>")
(setq inner-preamble "<header>
                 <div> <h3> <a href='../index.html'>Horhik's blog </a></h3></div>
      <div><ul>
        <li><a href='../posts/index.html'>Posts</a></li>
        <li><a href='../portfolio/index.html'>Portfolio</a></li>
        <li><a href='../about/index.html'>About</a></li>
        <li><a href='../donate/index.html'>Donate</a></li>
        <li><a href='../projects/index.html'>Projects</a></li>
       </ul></div>
                </header>")

(setq site-postamble "<footer><p>
               <b> This site is made by Horhik and all contens are under CC I forgot full license name </b>
             </p></footer>")
(setq org-html-preamble-format `(("en", inner-preamble)))    
(setq org-html-postamble-format `(("en", site-postamble)))                
#+end_center
