html/posts/my-emacs-config.html
<div id="outline-container-org1c6f258" class="outline-3">
<h3 id="org1c6f258"><span class="section-number-3">1.2.</span> Custom sections</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">defvar</span> <span style="color: #268bd2;">this-date-format</span> <span style="color: #2aa198;">"%b %d, %Y"</span><span style="color: #2aa198;">)</span>
<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">defun</span> <span style="color: #268bd2;">blog/html-postamble</span> <span style="color: #b58900;">(</span>plist<span style="color: #b58900;">)</span>
    <span style="color: #2aa198;">"PLIST."</span>
    <span style="color: #b58900;">(</span>concat <span style="color: #268bd2;">(</span>format
             <span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">with-temp-buffer</span>
               <span style="color: #859900;">(</span>insert-file-contents <span style="color: #b58900;">(</span>concat blog-templates <span style="color: #2aa198;">"postamble.html"</span><span style="color: #b58900;">)</span><span style="color: #859900;">)</span> <span style="color: #859900;">(</span>buffer-string<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span>
             <span style="color: #6c71c4;">(</span>format-time-string this-date-format <span style="color: #859900;">(</span>plist-get plist <span style="color: #839496; font-weight: bold;">:time</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span> <span style="color: #6c71c4;">(</span>plist-get plist <span style="color: #839496; font-weight: bold;">:creator</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

  <span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">defun</span> <span style="color: #268bd2;">blog/html-preamble</span> <span style="color: #b58900;">(</span>plist<span style="color: #b58900;">)</span>
  <span style="color: #2aa198;">"PLIST: An entry."</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #268bd2;">(</span>org-export-get-date plist this-date-format<span style="color: #268bd2;">)</span>
      <span style="color: #268bd2;">(</span>plist-put plist
                 <span style="color: #839496; font-weight: bold;">:subtitle</span> <span style="color: #6c71c4;">(</span>format <span style="color: #2aa198;">"Published on %s by %s."</span>
                                   <span style="color: #859900;">(</span>org-export-get-date plist this-date-format<span style="color: #859900;">)</span>
                                   <span style="color: #859900;">(</span>car <span style="color: #b58900;">(</span>plist-get plist <span style="color: #839496; font-weight: bold;">:author</span><span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span>
  <span style="color: #586e75;">;; </span><span style="color: #586e75;">Preamble</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">with-temp-buffer</span>
    <span style="color: #268bd2;">(</span>insert-file-contents <span style="color: #6c71c4;">(</span>concat blog-templates <span style="color: #2aa198;">"preamble.html"</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span> <span style="color: #268bd2;">(</span>buffer-string<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">defun</span> <span style="color: #268bd2;">blog/html-index-preamble</span> <span style="color: #b58900;">(</span>plist<span style="color: #b58900;">)</span>
  <span style="color: #2aa198;">"PLIST: An entry."</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #268bd2;">(</span>org-export-get-date plist this-date-format<span style="color: #268bd2;">)</span>
      <span style="color: #268bd2;">(</span>plist-put plist
                 <span style="color: #839496; font-weight: bold;">:subtitle</span> <span style="color: #6c71c4;">(</span>format <span style="color: #2aa198;">"Published on %s by %s."</span>
                                   <span style="color: #859900;">(</span>org-export-get-date plist this-date-format<span style="color: #859900;">)</span>
                                   <span style="color: #859900;">(</span>car <span style="color: #b58900;">(</span>plist-get plist <span style="color: #839496; font-weight: bold;">:author</span><span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span>
  <span style="color: #586e75;">;; </span><span style="color: #586e75;">Preamble</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">with-temp-buffer</span>
    <span style="color: #268bd2;">(</span>insert-file-contents <span style="color: #6c71c4;">(</span>concat blog-templates <span style="color: #2aa198;">"index-preamble.html"</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span> <span style="color: #268bd2;">(</span>buffer-string<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

</pre>
</div>
</div>
</div>
<div id="outline-container-org10338ec" class="outline-3">
<h3 id="org10338ec"><span class="section-number-3">1.3.</span> Sitemap</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">  <span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">defun</span> <span style="color: #268bd2;">me/org-sitemap-format-entry</span> <span style="color: #b58900;">(</span>entry style project<span style="color: #b58900;">)</span>
    <span style="color: #2aa198;">"Format posts with author and published data in the index page.</span>

<span style="color: #2aa198;">ENTRY: file-name</span>
<span style="color: #2aa198;">STYLE:</span>
<span style="color: #2aa198;">PROJECT: `posts in this case."</span>
    <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">cond</span> <span style="color: #268bd2;">(</span><span style="color: #6c71c4;">(</span>not <span style="color: #859900;">(</span>directory-name-p entry<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span>
           <span style="color: #6c71c4;">(</span>format <span style="color: #2aa198;">"*[[file:%s][%s]]*</span>
<span style="color: #2aa198;">                 #+HTML: &lt;p class='</span><span style="color: #268bd2; font-weight: bold;">pubdate</span><span style="color: #2aa198;">'&gt;by %s on %s.&lt;/p&gt;"</span>
                   entry
                   <span style="color: #859900;">(</span>org-publish-find-title entry project<span style="color: #859900;">)</span>
                   <span style="color: #859900;">(</span>car <span style="color: #b58900;">(</span>org-publish-find-property entry <span style="color: #839496; font-weight: bold;">:author</span> project<span style="color: #b58900;">)</span><span style="color: #859900;">)</span>
                   <span style="color: #859900;">(</span>format-time-string this-date-format
                                       <span style="color: #b58900;">(</span>org-publish-find-date entry project<span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
          <span style="color: #268bd2;">(</span><span style="color: #6c71c4;">(</span>eq style 'tree<span style="color: #6c71c4;">)</span> <span style="color: #6c71c4;">(</span>file-name-nondirectory <span style="color: #859900;">(</span>directory-file-name entry<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
          <span style="color: #268bd2;">(</span>t entry<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb161c83" class="outline-3">
<h3 id="orgb161c83"><span class="section-number-3">1.4.</span> Preambles and postambles</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-center">
<p>
(setq index-preamble "&lt;section&gt;
                 &lt;div&gt; &lt;h3&gt; Segmentation Fail. Horhik's blog &lt;/h3&gt;&lt;/div&gt;
      &lt;div&gt;&lt;ul&gt;
        &lt;li&gt;&lt;a href='./posts/index.html'&gt;Posts&lt;/a&gt;&lt;/li&gt;
        &lt;li&gt;&lt;a href='./portfolio/index.html'&gt;Portfolio&lt;/a&gt;&lt;/li&gt;
        &lt;li&gt;&lt;a href='./about/index.html'&gt;About&lt;/a&gt;&lt;/li&gt;
        &lt;li&gt;&lt;a href='./donate/index.html'&gt;Donate&lt;/a&gt;&lt;/li&gt;
        &lt;li&gt;&lt;a href='./projects/index.html'&gt;Projects&lt;/a&gt;&lt;/li&gt;
       &lt;/ul&gt;&lt;/div&gt;
                &lt;/section&gt;")
(setq inner-preamble "&lt;header&gt;
                 &lt;div&gt; &lt;h3&gt; &lt;a href='../index.html'&gt;Horhik's blog &lt;/a&gt;&lt;/h3&gt;&lt;/div&gt;
      &lt;div&gt;&lt;ul&gt;
        &lt;li&gt;&lt;a href='../posts/index.html'&gt;Posts&lt;/a&gt;&lt;/li&gt;
        &lt;li&gt;&lt;a href='../portfolio/index.html'&gt;Portfolio&lt;/a&gt;&lt;/li&gt;
        &lt;li&gt;&lt;a href='../about/index.html'&gt;About&lt;/a&gt;&lt;/li&gt;
        &lt;li&gt;&lt;a href='../donate/index.html'&gt;Donate&lt;/a&gt;&lt;/li&gt;
        &lt;li&gt;&lt;a href='../projects/index.html'&gt;Projects&lt;/a&gt;&lt;/li&gt;
       &lt;/ul&gt;&lt;/div&gt;
                &lt;/header&gt;")
</p>

<p>
(setq site-postamble "&lt;footer&gt;&lt;p&gt;
               &lt;b&gt; This site is made by Horhik and all contens are under CC I forgot full license name &lt;/b&gt;
             &lt;/p&gt;&lt;/footer&gt;")
(setq org-html-preamble-format `(("en", inner-preamble)))    
(setq org-html-postamble-format `(("en", site-postamble)))                
</p>
</div>
</div>
</div>
