pages/posts/my-emacs-config.org
** list
#+begin_src emacs-lisp
    (require 'ox-publish)


    (setq org-publish-project-alist
          `(
            ("blogposts"
             :base-directory ,(concat blog-content-path "posts")
             :base-extension "org"
             :publishing-directory ,(concat blog-static-path "posts")
             :publishing-function org-html-publish-to-html
             :recursive t
             :headline-levels 8             
             :html-preamble blog/html-preamble
             :html-postamble blog/html-postamble
             :auto-sitemap t
             :sitemap-filename "index.org"
             :sitemap-title "Blog Index"         
             :sitemap-format-entry me/org-sitemap-format-entry
             :sitemap-style list
             :with-tags t
             :with-toc t
             :section-numbers: nil
             :table-of-contents t
             :html-head-include-default-style nil
             )
            ("portfolio"
             :base-directory ,(concat blog-content-path  "portfolio")
             :base-extension "org"
             :publishing-directory ,(concat blog-static-path  "portfolio")
             :publishing-function org-html-publish-to-html
             :headline-levels 8             
             :html-preamble blog/html-preamble
             :html-postamble blog/html-postamble
             :auto-sitemap: t
             :sitemap-filename: "index.org"
             :sitemap-title: "Portfolio"
             :sitemap-format-entry me/org-sitemap-format-entry
             :sitemap-style list
             :validation-link nil
             :table-of-contents nil
             :html-head-include-default-style nil
             )
            ("about"
             :base-directory ,(concat blog-content-path  "about")
             :base-extension "org"
             :publishing-directory ,(concat blog-static-path  "about")
             :publishing-function org-html-publish-to-html
             :recursive t
             :headline-levels 8             
             :html-preamble blog/html-preamble
             :html-postamble blog/html-postamble
             :validation-link nil
             :table-of-contents nil
             :html-head-include-default-style nil
             )
  ("donate"
             :base-directory ,(concat blog-content-path  "donate")
             :base-extension "org"
             :publishing-directory ,(concat blog-static-path  "donate")
             :publishing-function org-html-publish-to-html
             :recursive t
             :headline-levels 8             
             :html-preamble blog/html-preamble
             :html-postamble blog/html-postamble
             :validation-link nil
             :table-of-contents nil
             :html-head-include-default-style nil
             )
            ("blogstatic"
             :base-directory "~/Blog/pages/"
             :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf"
             :publishing-directory "/home/horhik/Code/Blog/html/"
             :recursive t
             :publishing-function org-publish-attachment
             )
              ("index"
               :base-directory ,(concat blog-content-path "")
               :base-extension "org"
               :publishing-directory ,(concat blog-static-path "")
               :publishing-function org-html-publish-to-html
               :site-toc nil
               :table-of-contents: nil
               :auto-sitemap: t
               :sitemap-format-entry me/org-sitemap-format-entry
               :sitemap-style list
               :headline-levels 8             
               :html-preamble blog/html-index-preamble
               :html-postamble blog/html-postamble
               )
            ("Blog" :components ("blogposts" "blogstatic"  "portfolio" "about"  "index" "donate"))
            )
          )
#+end_src
