html/posts/my-emacs-config.html
<div id="outline-container-orgb3b59f6" class="outline-3">
<h3 id="orgb3b59f6"><span class="section-number-3">1.5.</span> list</h3>
<div class="outline-text-3" id="text-1-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">  <span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">require</span> '<span style="color: #268bd2; font-weight: bold;">ox-publish</span><span style="color: #2aa198;">)</span>


  <span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">setq</span> org-publish-project-alist
        `<span style="color: #b58900;">(</span>
          <span style="color: #268bd2;">(</span><span style="color: #2aa198;">"blogposts"</span>
           <span style="color: #839496; font-weight: bold;">:base-directory</span> ,<span style="color: #6c71c4;">(</span>concat blog-content-path <span style="color: #2aa198;">"posts"</span><span style="color: #6c71c4;">)</span>
           <span style="color: #839496; font-weight: bold;">:base-extension</span> <span style="color: #2aa198;">"org"</span>
           <span style="color: #839496; font-weight: bold;">:publishing-directory</span> ,<span style="color: #6c71c4;">(</span>concat blog-static-path <span style="color: #2aa198;">"posts"</span><span style="color: #6c71c4;">)</span>
           <span style="color: #839496; font-weight: bold;">:publishing-function</span> org-html-publish-to-html
           <span style="color: #839496; font-weight: bold;">:recursive</span> t
           <span style="color: #839496; font-weight: bold;">:headline-levels</span> 8             
           <span style="color: #839496; font-weight: bold;">:html-preamble</span> blog/html-preamble
           <span style="color: #839496; font-weight: bold;">:html-postamble</span> blog/html-postamble
           <span style="color: #839496; font-weight: bold;">:auto-sitemap</span> t
           <span style="color: #839496; font-weight: bold;">:sitemap-filename</span> <span style="color: #2aa198;">"index.org"</span>
           <span style="color: #839496; font-weight: bold;">:sitemap-title</span> <span style="color: #2aa198;">"Blog Index"</span>         
           <span style="color: #839496; font-weight: bold;">:sitemap-format-entry</span> me/org-sitemap-format-entry
           <span style="color: #839496; font-weight: bold;">:sitemap-style</span> list
           <span style="color: #839496; font-weight: bold;">:with-tags</span> t
           <span style="color: #839496; font-weight: bold;">:with-toc</span> t
           <span style="color: #839496; font-weight: bold;">:section-numbers:</span> nil
           <span style="color: #839496; font-weight: bold;">:table-of-contents</span> t
           <span style="color: #839496; font-weight: bold;">:html-head-include-default-style</span> nil
           <span style="color: #268bd2;">)</span>
          <span style="color: #268bd2;">(</span><span style="color: #2aa198;">"portfolio"</span>
           <span style="color: #839496; font-weight: bold;">:base-directory</span> ,<span style="color: #6c71c4;">(</span>concat blog-content-path  <span style="color: #2aa198;">"portfolio"</span><span style="color: #6c71c4;">)</span>
           <span style="color: #839496; font-weight: bold;">:base-extension</span> <span style="color: #2aa198;">"org"</span>
           <span style="color: #839496; font-weight: bold;">:publishing-directory</span> ,<span style="color: #6c71c4;">(</span>concat blog-static-path  <span style="color: #2aa198;">"portfolio"</span><span style="color: #6c71c4;">)</span>
           <span style="color: #839496; font-weight: bold;">:publishing-function</span> org-html-publish-to-html
           <span style="color: #839496; font-weight: bold;">:headline-levels</span> 8             
           <span style="color: #839496; font-weight: bold;">:html-preamble</span> blog/html-preamble
           <span style="color: #839496; font-weight: bold;">:html-postamble</span> blog/html-postamble
           <span style="color: #839496; font-weight: bold;">:auto-sitemap:</span> t
           <span style="color: #839496; font-weight: bold;">:sitemap-filename:</span> <span style="color: #2aa198;">"index.org"</span>
           <span style="color: #839496; font-weight: bold;">:sitemap-title:</span> <span style="color: #2aa198;">"Portfolio"</span>
           <span style="color: #839496; font-weight: bold;">:sitemap-format-entry</span> me/org-sitemap-format-entry
           <span style="color: #839496; font-weight: bold;">:sitemap-style</span> list
           <span style="color: #839496; font-weight: bold;">:validation-link</span> nil
           <span style="color: #839496; font-weight: bold;">:table-of-contents</span> nil
           <span style="color: #839496; font-weight: bold;">:html-head-include-default-style</span> nil
           <span style="color: #268bd2;">)</span>
          <span style="color: #268bd2;">(</span><span style="color: #2aa198;">"about"</span>
           <span style="color: #839496; font-weight: bold;">:base-directory</span> ,<span style="color: #6c71c4;">(</span>concat blog-content-path  <span style="color: #2aa198;">"about"</span><span style="color: #6c71c4;">)</span>
           <span style="color: #839496; font-weight: bold;">:base-extension</span> <span style="color: #2aa198;">"org"</span>
           <span style="color: #839496; font-weight: bold;">:publishing-directory</span> ,<span style="color: #6c71c4;">(</span>concat blog-static-path  <span style="color: #2aa198;">"about"</span><span style="color: #6c71c4;">)</span>
           <span style="color: #839496; font-weight: bold;">:publishing-function</span> org-html-publish-to-html
           <span style="color: #839496; font-weight: bold;">:recursive</span> t
           <span style="color: #839496; font-weight: bold;">:headline-levels</span> 8             
           <span style="color: #839496; font-weight: bold;">:html-preamble</span> blog/html-preamble
           <span style="color: #839496; font-weight: bold;">:html-postamble</span> blog/html-postamble
           <span style="color: #839496; font-weight: bold;">:validation-link</span> nil
           <span style="color: #839496; font-weight: bold;">:table-of-contents</span> nil
           <span style="color: #839496; font-weight: bold;">:html-head-include-default-style</span> nil
           <span style="color: #268bd2;">)</span>
<span style="color: #268bd2;">(</span><span style="color: #2aa198;">"donate"</span>
           <span style="color: #839496; font-weight: bold;">:base-directory</span> ,<span style="color: #6c71c4;">(</span>concat blog-content-path  <span style="color: #2aa198;">"donate"</span><span style="color: #6c71c4;">)</span>
           <span style="color: #839496; font-weight: bold;">:base-extension</span> <span style="color: #2aa198;">"org"</span>
           <span style="color: #839496; font-weight: bold;">:publishing-directory</span> ,<span style="color: #6c71c4;">(</span>concat blog-static-path  <span style="color: #2aa198;">"donate"</span><span style="color: #6c71c4;">)</span>
           <span style="color: #839496; font-weight: bold;">:publishing-function</span> org-html-publish-to-html
           <span style="color: #839496; font-weight: bold;">:recursive</span> t
           <span style="color: #839496; font-weight: bold;">:headline-levels</span> 8             
           <span style="color: #839496; font-weight: bold;">:html-preamble</span> blog/html-preamble
           <span style="color: #839496; font-weight: bold;">:html-postamble</span> blog/html-postamble
           <span style="color: #839496; font-weight: bold;">:validation-link</span> nil
           <span style="color: #839496; font-weight: bold;">:table-of-contents</span> nil
           <span style="color: #839496; font-weight: bold;">:html-head-include-default-style</span> nil
           <span style="color: #268bd2;">)</span>
          <span style="color: #268bd2;">(</span><span style="color: #2aa198;">"blogstatic"</span>
           <span style="color: #839496; font-weight: bold;">:base-directory</span> <span style="color: #2aa198;">"~/Blog/pages/"</span>
           <span style="color: #839496; font-weight: bold;">:base-extension</span> <span style="color: #2aa198;">"css</span><span style="color: #859900; font-weight: bold;">\\</span><span style="color: #b58900; font-weight: bold;">|</span><span style="color: #2aa198;">js</span><span style="color: #859900; font-weight: bold;">\\</span><span style="color: #b58900; font-weight: bold;">|</span><span style="color: #2aa198;">png</span><span style="color: #859900; font-weight: bold;">\\</span><span style="color: #b58900; font-weight: bold;">|</span><span style="color: #2aa198;">jpg</span><span style="color: #859900; font-weight: bold;">\\</span><span style="color: #b58900; font-weight: bold;">|</span><span style="color: #2aa198;">gif</span><span style="color: #859900; font-weight: bold;">\\</span><span style="color: #b58900; font-weight: bold;">|</span><span style="color: #2aa198;">pdf</span><span style="color: #859900; font-weight: bold;">\\</span><span style="color: #b58900; font-weight: bold;">|</span><span style="color: #2aa198;">mp3</span><span style="color: #859900; font-weight: bold;">\\</span><span style="color: #b58900; font-weight: bold;">|</span><span style="color: #2aa198;">ogg</span><span style="color: #859900; font-weight: bold;">\\</span><span style="color: #b58900; font-weight: bold;">|</span><span style="color: #2aa198;">swf"</span>
           <span style="color: #839496; font-weight: bold;">:publishing-directory</span> <span style="color: #2aa198;">"/home/horhik/Code/Blog/html/"</span>
           <span style="color: #839496; font-weight: bold;">:recursive</span> t
           <span style="color: #839496; font-weight: bold;">:publishing-function</span> org-publish-attachment
           <span style="color: #268bd2;">)</span>
            <span style="color: #268bd2;">(</span><span style="color: #2aa198;">"index"</span>
             <span style="color: #839496; font-weight: bold;">:base-directory</span> ,<span style="color: #6c71c4;">(</span>concat blog-content-path <span style="color: #2aa198;">""</span><span style="color: #6c71c4;">)</span>
             <span style="color: #839496; font-weight: bold;">:base-extension</span> <span style="color: #2aa198;">"org"</span>
             <span style="color: #839496; font-weight: bold;">:publishing-directory</span> ,<span style="color: #6c71c4;">(</span>concat blog-static-path <span style="color: #2aa198;">""</span><span style="color: #6c71c4;">)</span>
             <span style="color: #839496; font-weight: bold;">:publishing-function</span> org-html-publish-to-html
             <span style="color: #839496; font-weight: bold;">:site-toc</span> nil
             <span style="color: #839496; font-weight: bold;">:table-of-contents:</span> nil
             <span style="color: #839496; font-weight: bold;">:auto-sitemap:</span> t
             <span style="color: #839496; font-weight: bold;">:sitemap-format-entry</span> me/org-sitemap-format-entry
             <span style="color: #839496; font-weight: bold;">:sitemap-style</span> list
             <span style="color: #839496; font-weight: bold;">:headline-levels</span> 8             
             <span style="color: #839496; font-weight: bold;">:html-preamble</span> blog/html-index-preamble
             <span style="color: #839496; font-weight: bold;">:html-postamble</span> blog/html-postamble
             <span style="color: #268bd2;">)</span>
          <span style="color: #268bd2;">(</span><span style="color: #2aa198;">"Blog"</span> <span style="color: #839496; font-weight: bold;">:components</span> <span style="color: #6c71c4;">(</span><span style="color: #2aa198;">"blogposts"</span> <span style="color: #2aa198;">"blogstatic"</span>  <span style="color: #2aa198;">"portfolio"</span> <span style="color: #2aa198;">"about"</span>  <span style="color: #2aa198;">"index"</span> <span style="color: #2aa198;">"donate"</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
          <span style="color: #b58900;">)</span>
        <span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer">
  <i> Last update: "Apr 18, 2023" </i> <br>
  <b> Made by Horhik with ❤ and Emacs 28.2 (Org mode 9.6) </b> <br>
</footer>
</div>
</body>
</html>